[
  {
    "query": "A calculator to to basic maths",
    "score": 1.3218014240264893,
    "tool_id": "1",
    "tool_name": "calculator",
    "tool_description": "This is a secure mathematical calculator designed to evaluate a text-based arithmetic expression. It supports standard operations like addition, subtraction, multiplication, division, and exponents on both integer and floating-point numbers within a sandboxed environment.",
    "tool_git_link": "https://github.com/rahulsingh0327/calculator.git"
  },
  {
    "query": "Something that can convert units",
    "score": 3.666908025741577,
    "tool_id": "2",
    "tool_name": "unit converter",
    "tool_description": "This tool is a flexible unit converter capable of handling different categories of measurement. It supports conversions for length units (e.g., meters, feet) and temperature units (Celsius, Fahrenheit, Kelvin), requiring the input value, original unit, and target unit.",
    "tool_git_link": "https://github.com/rahulsingh0327/unit_converter.git"
  },
  {
    "query": "A system monitor that lets you check CPU and RAM usage",
    "score": 5.9671406745910645,
    "tool_id": "4",
    "tool_name": "system monitor",
    "tool_description": "A system monitoring tool that provides insight into the host environment. It can deliver a system summary (a snapshot of CPU, memory, and disk usage) or list the top n running processes ranked by their memory consumption. Requires the psutil library.",
    "tool_git_link": "https://github.com/rahulsingh0327/system_monitor.git"
  },
  {
    "query": "A random data generator for testing purposes",
    "score": 6.351109504699707,
    "tool_id": "8",
    "tool_name": "Random",
    "tool_description": "This tool is designed to generate various types of random data, useful for testing or security. It can generate UUIDs, cryptographic tokens or hex strings (by length in bytes), or a random integer within a specified upper bound.",
    "tool_git_link": "https://github.com/rahulsingh0327/random_tool.git"
  }
]